<?php

// 100 : 치명적인 오류 메시지(내부오류)
$_STRINGSET[101] = "컨텐츠 등록 중 오류가 발생하여 등록이 중단되었습니다.";
$_STRINGSET[102] = "요청하신 파일이 등록되지 않았거나 삭제되어 다운로드가 중단되었습니다.";
$_STRINGSET[103] = "회원탈퇴가 실패하였습니다. 사이트 관리자에게 문의하십시오.";
$_STRINGSET[104] = "정보수정 중 오류가 발생하여 수정이 중단되었습니다.";


// 200 : 성공 메시지
$_STRINGSET[201] = "성공적으로 회원 가입이 완료 되었습니다.";
$_STRINGSET[202] = "성공적으로 정보가 등록 되었습니다.";
$_STRINGSET[203] = "성공적으로 정보가 수정 되었습니다.";
$_STRINGSET[204] = "성공적으로 정보가 적용 되었습니다.";
$_STRINGSET[205] = "성공적으로 정보가 삭제 되었습니다.";
$_STRINGSET[206] = "성공적으로 컨텐츠 평가글이 등록 되었습니다.";
$_STRINGSET[207] = "회원이 되신것을 진심으로 축하합니다.";
$_STRINGSET[208] = "장바구니에 담았습니다. 장바구니로 이동하시겠습니까?";
$_STRINGSET[209] = "나의 찜목록에 등록되었습니다. 나의 찜목록으로 이동하시겠습니까?";
$_STRINGSET[210] = "성공적으로 삭제요청이 완료 되었습니다.";
$_STRINGSET[211] = "성공적으로 승인상태가 적용 되었습니다.";
$_STRINGSET[212] = "고객 아이디가 확인되었습니다. 컨텐츠를 등록하셔도 좋습니다."; // 관리자 컨텐츠 수동 등록시 사용
$_STRINGSET[213] = "장바구니에 담았습니다. 결제페이지로 이동하시겠습니까?"; // 참고 : 처리페이지에서 노출하지 않음
$_STRINGSET[214] = "성공적으로 탈퇴신청이 완료 되었습니다.";
$_STRINGSET[215] = "성공적으로 결제건이 삭제 되었습니다.";
$_STRINGSET[216] = "자료번호에 대한 컨텐츠가 확인되었습니다."; // 저작권침해신고 페이지에서 사용
$_STRINGSET[217] = "스트리밍서버 접속이 성공하였습니다.";
$_STRINGSET[218] = "성공적으로 컨텐츠 평가글이 삭제 되었습니다.";

$_STRINGSET[220] = "성공적으로 무통장결제 신청이 접수 되었습니다.";
$_STRINGSET[221] = "성공적으로 캐쉬 적립이 완료 되었습니다.";
$_STRINGSET[222] = "성공적으로 캐쉬결제가 완료 되었습니다.";
$_STRINGSET[223] = "카테고리 수정이 완료 되었습니다.";
$_STRINGSET[224] = "카테고리 변경이 완료 되었습니다.";
$_STRINGSET[225] = "카테고리 순위변경 완료 되었습니다.";


// 300 : 경고 메시지
$_STRINGSET[301] = "요청하신 페이지를 찾을 수 없습니다.";
$_STRINGSET[302] = "죄송합니다. 입력하신 아이디가 존재하지 않습니다.";
$_STRINGSET[303] = "죄송합니다. 입력하신 비밀번호가 일치하지 않습니다.";
$_STRINGSET[304] = "죄송합니다. 고객님은 현재 회원탈퇴를 신청하신 상태입니다.";
$_STRINGSET[305] = "죄송합니다. 입력하신 정보와 일치하는 계정이 존재하지 않습니다.";
$_STRINGSET[306] = "죄송합니다. 검색결과가 존재하지 않습니다.";
$_STRINGSET[307] = "죄송합니다. 고객님은 업체회원이 아닙니다.";

// 400 : 실패 메시지
$_STRINGSET[401] = "회원 가입이 실패하였습니다.";
$_STRINGSET[402] = "정보 등록이 실패하였습니다.";
$_STRINGSET[403] = "정보 수정이 실패하였습니다.";
$_STRINGSET[404] = "정보 적용이 실패하였습니다.";
$_STRINGSET[405] = "정보 삭제가 실패하였습니다.";
$_STRINGSET[406] = "컨텐츠 평가글 등록이 실패하였습니다.";
$_STRINGSET[407] = $_STRINGSET[401]; // 회원 가입 실패
$_STRINGSET[408] = $_STRINGSET[402]; // 장바구니 등록 실패
$_STRINGSET[409] = $_STRINGSET[402]; // 찜목록에 등록 실패
$_STRINGSET[410] = "삭제요청이 실패하였습니다.";
$_STRINGSET[411] = "승인상태 적용이 실패하였습니다.";
$_STRINGSET[412] = "[ {아이디} ]와 일치하는 고객 아이디는 존재하지 않습니다."; // {아이디} 값은 실제 ID 로 치환
$_STRINGSET[413] = "죄송합니다. 해당 컨텐츠는 구매하실 수 없습니다.";
$_STRINGSET[414] = "죄송합니다. 탈퇴신청이 실패하였습니다.";
$_STRINGSET[415] = "죄송합니다. 결제건 삭제가 실패하였습니다.";
$_STRINGSET[416] = "죄송합니다. 자료번호에 대한 컨텐츠 확인이 실패하였습니다."; // 저작권침해신고 페이지에서 사용
$_STRINGSET[417] = "스트리밍서버 접속이 실패하였습니다.";
$_STRINGSET[418] = "죄송합니다. 컨텐츠 평가글 삭제가 실패하였습니다.";

$_STRINGSET[420] = "죄송합니다. 자신이 등록한 컨텐츠는 등록할 수 없습니다.";
$_STRINGSET[421] = "죄송합니다. 이미 목록에 등록되어 있는 컨텐츠입니다.";
$_STRINGSET[222] = "성공적으로 캐쉬결제가 완료 되었습니다.";
$_STRINGSET[423] = "카테고리 수정이 실패하였습니다..";
$_STRINGSET[424] = "카테고리 변경이 실패하였습니다..";
$_STRINGSET[425] = "카테고리 순위변경 실패하였습니다..";



// 500 : 접근권한 오류 메시지
$_STRINGSET[501] = "컨텐츠 등록이 완료되었거나 비정상적인 접근을 시도하였습니다.";
$_STRINGSET[502] = "컨텐츠가 존재하지 않거나 비정상적인 접근을 시도하였습니다.";
$_STRINGSET[503] = "죄송합니다. 고객님은 현재 로그인이 되어 있지 않습니다.";
$_STRINGSET[504] = "입력 정보가 일치하지 않거나 비정상적인 접근을 시도하였습니다.";
$_STRINGSET[505] = "죄송합니다. 관리자로 로그인이 되어 있지 않습니다.";
$_STRINGSET[506] = "컨텐츠 등록권한이 없습니다. 관리자에게 문의하시기 바랍니다.";
$_STRINGSET[507] = "죄송합니다. 컨텐츠 평가권한이 없거나 해당 컨텐츠가 존재하지 않습니다.";
$_STRINGSET[508] = "최상위 랭킹입니다.";
?>