var _STRINGSET = {};
// 100 : 치명적인 오류



// 200 : 성공 메시지



// 300 : 경고 메시지
_STRINGSET[301] = "회원가입을 하시려면 약관에 동의하셔야 합니다.";
_STRINGSET[302] = "구매하실 컨텐츠를 선택하여 주십시오.";
_STRINGSET[303] = "선택된 컨텐츠가 없습니다.";
_STRINGSET[304] = "선택된 회원이 없습니다.";
_STRINGSET[305] = "적용하실 명령을 선택하여 주십시오.";
_STRINGSET[306] = "삭제하실 항목을 선택하여 주십시오.";
_STRINGSET[307] = "변경하실 카테고리 선택하여 주십시오.";
_STRINGSET[308] = "이동하실 카테고리 선택하여 주십시오.";
// 400 : 실패 메시지



// 500 : 권한
_STRINGSET[503] = "죄송합니다. 고객님은 현재 로그인이 되어 있지 않습니다.";


// 600 : 질의
_STRINGSET[601] = "해당 컨텐츠를 장바구니에 넣으시겠습니까?";
_STRINGSET[602] = "해당 컨텐츠를 찜목록에 등록하시겠습니까?";
_STRINGSET[603] = "선택하신 컨텐츠를 삭제하시겠습니까?";
_STRINGSET[604] = "컨텐츠 등록을 취소하시겠습니까?\n등록을 취소하시려면 [확인] 버튼을 누르시기 바랍니다.\n\n-[안내]-\n1. 등록취소 시 입력했던 정보는 모두 사라집니다.\n2. 컨텐츠를 등록한 후에는 수정이 불가능하오니 신중하게 입력하시기 바랍니다.";
_STRINGSET[605] = "선택하신 컨텐츠의 승인상태를 변경하시겠습니까?";
_STRINGSET[606] = "컨텐츠 등록을 취소하시겠습니까?\n등록을 취소하시려면 [확인] 버튼을 누르시기 바랍니다."+SPACE+"\n\n-[안내]-\n등록취소 시 입력했던 정보는 모두 사라집니다.";
_STRINGSET[607] = "해당 컨텐츠를 즉시구매 하시겠습니까?";
_STRINGSET[608] = "무료 컨텐츠만 구매하시겠습니까?"; // 사용할 일이 없다
_STRINGSET[609] = "선택하신 컨텐츠를 지금 구매하시겠습니까?";
_STRINGSET[610] = "선택하신 항목을 삭제하시겠습니까?";
_STRINGSET[611] = "선택하신 컨텐츠를 삭제요청하시겠습니까?";
_STRINGSET[612] = "선택하신 회원의 설정값을 적용하시겠습니까?";
_STRINGSET[613] = "선택하신 회원을 삭제하시겠습니까?";
_STRINGSET[614] = "선택하신 컨텐츠 평가글을 삭제하시겠습니까?";
_STRINGSET[615] = "입력하신 값들을 초기값으로 되돌리시겠습니까?";
_STRINGSET[616] = "선택하신 카테고리 삭제하시겠습니까?";